[
  {
    "chunk_id": "chunk_0",
    "source": "customer_feedbacks.txt",
    "text": "2024-01-03 App Review | Indigo | 6E-217 | DEL→BOM | Rating: 1★ Flight cancelled at 5 AM. No SMS. Reached airport at 4 AM; security said “cancelled”. Indigo counter empty. Customer care wait: 45 min. Reason given: weather, but GoAir flew same time. Refund in 7 days. Very poor experience. Twitter | @indigo6E | @rajesh_kapoor89 Complaint: Flight 6E217 cancelled. Questions airline’s “fog excuse” since GoAir operated normally. Twitter Reply | @indigo6E Airline cites aircraft rotation and crew duty regulations. Refund initiated. 2024-01-04 Email | Priya Sharma | PNR: X7K9P2 Formal complaint about cancellation, rude staff, 14-hour delay, inadequate meal voucher. Requests refund + ₹5000 compensation + apology + points. 2024-01-05 Call Transcript | Indigo | Agent: Rahul | PNR: X7K9P2 Airline denies compensation due to weather category. Caller threatens DGCA escalation. 2024-01-12 Google Play Review | SpiceJet | SG-817 | Rating: 1★ Charged for seat, seat changed anyway, 3.5 hr delay, stale sandwich. 2024-01-15 WhatsApp | Vistara Care Cancelled flight UK926. Vistara rebooked automatically + refund + 5000 CV points. Positive experience. 2024-01-18 Facebook Post | Air India Complaint about cold/dry meal on AI-144. Air India Reply Requests PNR and seat details. 2024-01-20 Handwritten Complaint | Indigo | PNR: K3P9M1 Cancellation suspected false (“technical” but same aircraft flew elsewhere). Missed wedding. No hotel. Requests refund + free ticket + apology. 2024-01-22 App Review | SpiceJet | Rating: 2★ Extra baggage counter charges higher than online rate. 2024-01-25 Twitter Thread | @tanya_bakes Comparison: Vistara praised for proactive rebooking; Indigo criticized for ₹150 voucher and poor alerts. 2024-01-28 Email Chain | Air India Positive review from business-class passenger appreciating food, crew, seats, and punctuality. 2024-02-01 Call Center | SpiceJet | Agent: Priyanka Argument over cause of cancellation (passenger claims technical, system says weather). Call escalated. 2024-02-05 Instagram Comment | Indigo Complaint: 4-hour delay, no free water, ₹100 charged. 2024-02-09 App Review | Vistara | 5★ Cancelled flight, but hotel at Taj arranged + rebooking. Strong praise. 2024-02-14 Twitter | @spicejet App crash during check-in, charged extra at counter. 2024-02-18 Email | Air India Lost Baggage | PNR: AI3K9M Baggage missing for 5 days, medical impact. 2024-02-20 Google Review | Indigo Complaint about wheelchair assistance delay for elderly parent. 2024-02-25 WhatsApp | Vistara Cancelled flight. Rebooked + ₹1000 voucher. Positive sentiment. 2024-03-01 Facebook Marketplace Scam Fake “Indigo Refund Helper” account. 47 victims reported. 2024-03-05 App Review | Indigo | 1★ Online check-in shows success, but not in system. Charged ₹1000 extra. 2024-03-10 Call Transcript | Air India Passenger demands compensation/upgrade for delay. Only voucher offered. 2024-03-15 Internal Slack | Indigo 23 complaints due to SMS vendor outage. IT escalation. 2024-03-18 Twitter | @airindia Complaint: Broken business-class seat. 2024-03-22 Email | Vistara Premium Economy Positive experience: quiet cabin, hot towel, good meals. 2024-04-01 April Fool’s Fake Review | SpiceJet False “free helicopter transfer” claim deleted. 2024-04-05 App Review | Akasa | 4★ Clean aircraft, good crew, no IFE. 2024-04-10 WhatsApp | Indigo Cancellation blamed on dust storm; customer disputes reasoning."
  },
  {
    "chunk_id": "chunk_1",
    "source": "customer_feedbacks.txt",
    "text": "2024-04-15 Google Review | Goa Airport Vistara praised; Indigo chaotic; SpiceJet counter closed. 2024-04-20 Email Chain | SpiceJet Double baggage charging issue; refund pending 20 days. 2024-05-01 App Review | Air India | 1★ Received wrong meal (Jain request ignored). Medical consequences. 2024-05-05 Instagram Reel | SpiceJet Empty counter at 3 AM after cancellation. Viral clip. 2024-05-10 Twitter Poll | @travelindia Best cancellation handling: Vistara 68%, AI 15%, Indigo 12%, SpiceJet 5%. 2024-05-15 Call Log | Vistara Chocolate melted due to interline baggage transfer. Given ₹500 voucher. 2024-06-01 App Review | Indigo | 5★ Positive flight experience. 2024-06-05 Email | Air India Positive family travel experience. 2024-06-10 Twitter | @spicejet Web check-in failures; counter charges. 2024-06-15 Internal Memo | Indigo June cancellations up 18% due to monsoon. Target: 95% SMS delivery. 2024-06-20 App Review | Vistara | 5★ Real-time baggage tracking praised. 2024-07-01 Fake Review Bot 47 bot reviews posted before flagged. 2024-07-05 WhatsApp | Air India Delay caused missed connection. 2024-07-10 Instagram Story | Vistara Positive meal review. 2024-07-15 Email | SpiceJet Allegation of bribe demand for baggage settlement. 2024-08-01 App Review | Indigo | 1★ PNR not found, refund pending 15 days. 2024-08-05 Twitter | @vistara Praise for late-night proactive cancellation communication. 2024-08-10 Google Review | Bengaluru Airport Indigo helpful; SpiceJet absent; Air India slow; Vistara smiling. 2024-08-15 Call Transcript | SpiceJet Passenger disputes “technical” reason. Call ended. 2024-09-01 App Review | Air India | 3★ Meals free and hot; crew okay; aircraft old. 2024-09-05 WhatsApp | Vistara Instant seat change assistance. 2024-09-10 Twitter | @indigo6E Complaint about priority check-in. 2024-09-15 Email | Indigo Thank-you note for improved operations in September. 2024-10-01 App Review | SpiceJet | 1★ Seat unfairly changed. 2024-10-05 Instagram | Vistara Positive business-class experience. 2024-10-10 Call Log | Air India Complaint about broken seat; minimal response. 2024-10-15 Twitter | @spicejet Missed flight due to no announcement. 2024-11-01 App Review | Vistara | 5★ Excellent cancellation management. 2024-11-05 Email | Indigo Customer losing trust after 3 cancellations. 2024-11-10 WhatsApp | Air India Cold meal complaint; customer says they’re done with AI. 2024-11-15 App Review | SpiceJet | 1★ App crash, counter charge, stale food. 2024-12-01 Twitter | Vistara High praise. 2024-12-05 Email | Indigo Passenger from Jan reports major improvements in December. 2024-12-10 App Review | Air India | 2★ Free meal but poor taste; rude crew. 2024-12-15 Instagram | Vistara Christmas meal praised. 2024-12-20 Call Log | SpiceJet Fourth cancellation for customer. 2024-12-25 WhatsApp | Vistara Friendly holiday exchange. SUMMARY METRICS Spam/Bot Entries: 47 DGCA Escalations: 23 Refunds Pending >30 Days: 68 Total Unique Passengers: ~1,800"
  },
  {
    "chunk_id": "chunk_2",
    "source": "flight_cancellations.txt",
    "text": "INDIAN DOMESTIC & INTERNATIONAL FLIGHT CANCELLATION REPORT – FULL YEAR 2024 Compiled by: Civil Aviation Analytics Division (CAAD) Report Version: 4.2 Last Updated: December 31, 2024 EXECUTIVE SUMMARY Total cancellations in 2024: 18,742 Increase from 2023: 14.2% (2023 total: 16,413) Primary causes: Weather events (fog, cyclones, heatwaves): 48% Technical & maintenance issues: 31% Crew shortages & operational bottlenecks: 15% ATC restrictions: 6% Airline Highlights: Indigo: 8,920 cancellations, lowest rate per 1,000 flights (4.1) Vistara: 1,108 cancellations, best rate (1.9/1000) Peak months: January, May, October Worst routes: Delhi–Mumbai, Mumbai–Goa, Delhi–Srinagar This report includes monthly data, route-wide impact, root causes, refund compliance, delays, internal memos, NOTAMs, closure logs, and forecast vs actual."
  },
  {
    "chunk_id": "chunk_3",
    "source": "flight_cancellations.txt",
    "text": "SECTION 1: MONTHLY CANCELLATION STATISTICS (DOMESTIC + INTERNATIONAL) JANUARY 2024 Total cancellations: 2841 Weather-related: 2208 Top affected airports: DEL, BOM, CCU, LKO, PAT Indigo Total: 320 (Domestic: 298, International: 22) Main reason: Dense fog (visibility <50m) Route impact: Delhi–Mumbai: 192, Delhi–Srinagar: 48, Delhi–Lucknow: 36 Refunds: 95% within 48 hours Avg delay: 60 min Compensation: ₹200 meal voucher SpiceJet Cancellations: 148 Technical: 92 Weather: 18 Crew shortage: 38 Avg delay: 105 min Last-minute cancellations: 41% Complaints: 312 Air India Cancellations: 89 International: 68, Domestic: 21 Crew rest violations: 52 Avg delay: 88 min Vistara Cancellations: 42 Reason: Scheduled heavy maintenance Rebooked: 98% passengers Compensation: ₹1000 voucher Akasa Air Cancellations: 56 Reason: Fleet scaling issues Mumbai–Ahmedabad: 100% cancellations on Jan 3–4 FEBRUARY 2024 Total cancellations: 2412 Weather: 1550 ATC restrictions: 420 Indigo Total: 280 Delhi–Goa: 84 (runway resurfacing) Delhi–Mumbai: 78 Introduced Fog Prediction AI SMS alerts: Avg 6.8 hours before departure SpiceJet Total: 110 Last-minute: 44 Introduced ₹500 voucher for delays >3 hours Air India Total: 65 Crew-related cancellations reduced by 63% Vistara Total: 28 Introduced “Zero Cancellation Guarantee” MARCH 2024 Total cancellations: 1980 Heatwave impact: 1100 Indigo Cancellations: 180 Chennai–Kochi: 62 Avg delay: 72 min SpiceJet Cancellations: 95 Fleet utilization: 68% APRIL 2024 Total cancellations: 1602 Cyclone Remal: 480 Indigo: 168 (Kolkata–Port Blair: 72) SpiceJet: 82 MAY 2024 Total cancellations: 2108 Heat peak month (temperatures >45°C) Indigo: 298 Delhi–Jaipur: 110 Delhi–Leh: 68 Introduced \"Heat Protocol\" JUNE 2024 Total cancellations: 1440 Monsoon onset: 890 Indigo: 152 Mumbai–Goa: 82 Goa airport closed 38 hours JULY–SEPTEMBER SUMMARY (Q3 2024) Total cancellations: 4120 Monsoon impact: 2800 ATC delays: 620 Indigo: 620 SpiceJet: 310 Air India: 205 Vistara: 98 OCTOBER 2024 Total cancellations: 1892 Cyclone Dana: 1200 Indigo: 208 NOVEMBER 2024 Total cancellations: 1510 Fog: 1100 Indigo: 188 DECEMBER 2024 Total cancellations: 1837 Peak day: Dec 23 (42 cancellations in 6 hours) Indigo: 242 SECTION 2: ROUTE-WISE CANCELLATION HEATMAP (2024) (Top 10 routes) Rank | Route | Cancellations | Percent | Main Reason 1 | Delhi–Mumbai | 1842 | 9.8% | Fog 2 | Mumbai–Goa | 1408 | 7.5% | Monsoon 3 | Delhi–Bengaluru | 1210 | 6.5% | Heat, ATC 4 | Delhi–Srinagar | 980 | 5.2% | Snow 5 | Bengaluru–Hyderabad | 890 | 4.8% | Heat 6 | Mumbai–Chennai | 782 | 4.2% | Cyclone 7 | Delhi–Goa | 710 | 3.8% | Fog, runway work 8 | Kolkata–Port Blair | 620 | 3.3% | Cyclone 9 | Delhi–Lucknow | 590 | 3.1% | Fog 10 | Mumbai–Ahmedabad | 512 | 2.7% | Technical SECTION 3: ROOT CAUSE CLASSIFICATION Cause | Count | Percent Weather | 9010 | 48% Technical | 5810 | 31% Crew shortage | 2810 | 15% ATC/slot | 1122 | 6% Other | 990 | 5% SECTION 4: COMPENSATION & REFUND COMPLIANCE Airline | Eligible | Compensated | Compliance | DGCA Penalty Indigo | 842000 | 801000 | 95.1% | None SpiceJet | 182000 | 111000 | 61.0% | ₹5.2 Cr Air India | 98000 | 92000 | 93.9% | None Vistara | 42000 | 42000 | 100% | None SECTION 5: AVERAGE DELAY (MINUTES) Month | Indigo | SpiceJet | Air India | Vistara | Industry Jan | 60 | 105 | 88 | 42 | 74 Feb | 68 | 98 | 75 | 38 | 70 Mar | 72 | 92 | 70 | 40 | 68 Apr | 65 | 88 | 68 | 35 | 64 May | 82 | 110 | 78 | 45 | 79 Jun | 78 | 102 | 72 | 42 | 74 Jul | 70 | 95 | 68 | 38 | 68 Aug | 68 | 90 | 65 | 36 | 65 Sep | 65 | 88 | 62 | 34 | 62 Oct | 72 | 98 | 70 | 40 | 70 Nov | 75 | 102 | 74 | 42 | 73 Dec | 80 | 108 | 78 | 45 | 78 SECTION 6: INTERNAL MEMOS & NOTAM EXCERPTS Indigo Memo – Jan 5, 2024 \"Implement CAT IIIB operations by Jan 15...\" SpiceJet Engineering Alert – Feb 14, 2024 \"VT-SPU grounded due to cracked windshield...\" Air India NOTAM – Mar 22, 2024 \"Runway 27L closed 2200–0600 UTC...\" Vistara Message – Jun 8, 2024 \"Your flight UK926 has been cancelled...\" SECTION 7: REGIONAL AIRPORT CLOSURE LOG Airport | Dates | Hours | Reason | Flights Affected GOX | Feb 10–18 | 192 | Runway | 420 CCU | Apr 28–30 | 72 | Cyclone | 310 BBI | Oct 24–26 | 68 | Cyclone | 280 PAT | Nov 12–14 | 54 | Fog equipment | 180 JAI | May 15–17 | 60 | Heat | 220 SECTION 8: FORECAST vs ACTUAL (YEAR-END) Metric | Forecast | Actual | Variance Total cancellations | 16500 | 18742 | +13.6% Weather impact | 40% | 48% | +20% Indigo market share | 52% | 47.6% | –8.3% Vistara OTP | 94% | 96.8% | +3% GLOSSARY CAT IIIB: Low visibility landing (<50m) NOTAM: Notice to Airmen OTP: On-Time Performance DGCA: Aviation regulator CV Points: Club Vistara loyalty currency"
  },
  {
    "chunk_id": "chunk_4",
    "source": "airline_policies.txt",
    "text": "WELCOME TO THE POLICY MAZE — effective until further notice or until we change our mind, whichever comes first. This document supersedes all previous versions, except the one you printed last week, which is still valid for flights booked before 15th March 2024 but only if you’re flying from Terminal 2 and not on a Tuesday. For clarity, there is no clarity. Please continue reading at your own risk. Indigo, SpiceJet, Air India, and Vistara reserve the right to interpret, misinterpret, or ignore any clause at any time without prior intimation. Refunds are processed within 7–10 working days, where “working” excludes weekends, holidays, fog, heat, rain, and server maintenance. BAGGAGE — the eternal battleground. Indigo allows 15 kg checked baggage for domestic economy passengers as per the standard fare rules published on 1st January 2024, but if you booked via a third-party OTA before 28th February 2024, the limit is 15 kg only if your PNR starts with 6E, otherwise it’s 15 kg minus 1 kg for flights departing between 0600 and 0900 hours because morning flights are heavier due to dew or something. Excess baggage is charged at ₹400 per kg if paid online at least 2 hours before departure, ₹450 per kg if paid between 2 hours and 45 minutes before departure, and ₹500 per kg at the airport counter unless the counter agent is in a good mood in which case it might be ₹450 but don’t quote us. Cabin baggage is 7 kg including laptop and ego but excluding duty-free liquor which must be carried in a transparent bag and shown to security who will confiscate it anyway if it’s over 100 ml or if they’re having a bad day. Vistara allows 15 kg checked in economy but 30 kg on international and 10 kg extra in Premium Economy but only if you’re a Club Vistara Platinum member or if you smile at check-in and say “namaste” with folded hands in which case the agent might upgrade your baggage allowance to 40 kg but only on flights operated by UK-registered aircraft not codeshare. Air India allows 25 kg domestic, 23 kg international economy, 30 kg business, 40 kg first, but if you’re flying from Mumbai to Dubai on a Tuesday in May, it’s 20 kg because of heat-related weight restrictions as per NOTAM AIC 018/24 which was cancelled but then reissued as AIC 022/24 so now it’s 23 kg again but only if your ticket was issued after 17th June 2024. SpiceJet allows 15 kg checked and 7 kg cabin but charges ₹500 per kg excess at counter even if you paid ₹400 online because “system not synced” as per their internal memo dated 12th March 2024 which was leaked on Twitter and then deleted but screenshots exist. MEALS — or the lack thereof."
  },
  {
    "chunk_id": "chunk_5",
    "source": "airline_policies.txt",
    "text": "Indigo does not provide complimentary meals on domestic flights under 90 minutes unless the flight is delayed by more than 2 hours in which case a ₹150 meal voucher is issued redeemable only at select outlets which are always closed. For flights over 90 minutes, pre-book meals are mandatory and cost ₹250–₹400 depending on whether you want veg, non-veg, Jain, or “surprise me” which is usually a stale sandwich. No free water. Buy from trolley. ₹100 for 500 ml. Air India provides free meals on all flights over 2 hours including hot meals on international sectors with a choice of Indian, Continental, or Jain but if you forget to pre-select 24 hours in advance you get whatever is left which is usually the chicken even if you’re vegetarian. Alcohol is complimentary on international flights in business and first but only after takeoff and only if the crew feels like opening the bar. Vistara provides complimentary meals on all flights including short domestic hops with real cutlery and Taj-curated menus but bamboo cutlery on select routes to save the planet but only if the flight departs after 1st July 2024 and only on A320neo aircraft not on wet-lease from Air India. SpiceJet has buy-on-board only with prices ranging from ₹150 for a sandwich to ₹300 for a “meal box” which contains one sandwich, one cookie, and one juice but stock runs out after row 10. SEAT SELECTION — the illusion of choice. Indigo offers free seat selection during web check-in 48 hours to 1 hour before departure but only middle seats in the back unless you pay ₹300–₹800 for advance selection or ₹99 for auto-assigned window if you’re lucky. SpiceJet charges ₹150 for window or aisle, ₹99 for middle, and ₹400 for extra legroom but if you don’t pre-select you get auto-assigned a middle seat between two crying babies. Air India offers free seat selection at booking for all classes but preferred seats with extra legroom cost ₹500–₹2,000 and are non-refundable even if the flight is cancelled due to fog. Vistara offers free seat selection for Premium Economy and Business, ₹200–₹600 for economy, but if you’re a Club Vistara Gold member you get free advance selection including extra legroom but only if you log in via the app not the website because the website still shows old rules from 2023. CANCELLATION & REFUNDS — the black hole. Indigo allows free cancellation within 24 hours of booking if departure is more than 7 days away but after that it’s ₹3,500 fee for domestic, ₹4,500 for international, and no refund if less than 3 hours to departure unless the cancellation is due to weather or technical in which case full refund within 48 hours but only if you fill Form 7B online and upload a selfie with your boarding pass and a newspaper showing the date."
  },
  {
    "chunk_id": "chunk_6",
    "source": "airline_policies.txt",
    "text": "Weather includes fog, rain, heat, cold, wind, calm, and “operational reasons” which is code for “we don’t know.” SpiceJet charges ₹3,199 for cancellation more than 24 hours before departure, no refund if less than 24 hours, and full forfeiture for no-show but if the flight is cancelled by the airline you get full refund or rebooking but no hotel unless delay is more than 6 hours and only if you’re at the airport and only if the hotel has rooms and only if the airline feels like it. Air India charges ₹2,500 for domestic cancellation up to 3 hours before departure, 10% of fare or USD 100 whichever is lower for international, and full refund for medical emergencies with doctor certificate but only if the certificate is on hospital letterhead with stamp and signature and blood group and only if submitted within 7 days of cancellation. Vistara charges ₹2,999 domestic, USD 75 international up to 3 hours before departure, and offers Cancellation Protection Add-on for ₹399 which guarantees full refund no questions asked but only if purchased at booking and only if the cancellation is initiated via the app not call center because call center agents don’t have access to the add-on refund module. WEB CHECK-IN — the digital gauntlet. Indigo web check-in opens 48 hours and closes 1 hour before departure but only if you’re not carrying check-in baggage in which case it closes 45 minutes before and only if you’re not flying from Srinagar in which case it closes 2 hours before because of security. Boarding gate closes 25 minutes before departure but if you’re at the gate 26 minutes before you’re offloaded and your baggage is removed and you have to pay ₹5,000 rebooking fee. SpiceJet web check-in opens 48 hours and closes 1 hour but crashes every Friday between 8 PM and 10 PM IST due to server overload so better do it on Thursday or pay ₹500 at counter. Air India web check-in opens 48 hours and closes 2 hours before international, 1 hour before domestic, but if you’re flying from Kochi it closes 3 hours before because of fog even in summer. Vistara web check-in opens 48 hours and closes 45 minutes before but if you’re a Club Vistara member it stays open until 30 minutes before but only if you’re checking in via the app and have biometric verification enabled. LOYALTY PROGRAMS — the carrot and the stick. Indigo has no loyalty program because “we believe in low fares not points” but actually they have IndiGo Plus which gives priority check-in and free seat selection but costs ₹999 per year and is non-refundable even if you never fly. Air India has Flying Returns with 8 miles per ₹100 spent in economy, 10 in business, 12 in first, but miles expire after 3 years unless you fly once every 18 months or have a co-branded credit card which charges ₹1,500 annual fee."
  },
  {
    "chunk_id": "chunk_7",
    "source": "airline_policies.txt",
    "text": "Vistara has Club Vistara with 1 CV Point per ₹100 spent, tier levels Silver, Gold, Platinum, with benefits like free seat selection, extra baggage, lounge access, but if you don’t fly 3 times in 12 months you drop to base level and lose everything. SpiceJet has SpiceClub with 1 point per ₹100 but points can only be redeemed for base fare not taxes and only on select routes and only if the flight is not full and only if the moon is in waxing phase. SPECIAL ASSISTANCE — the fine print. Wheelchair assistance must be requested 48 hours in advance for Indigo, 24 hours for Air India, 72 hours for Vistara if you’re flying international, and never for SpiceJet because they don’t have wheelchairs at most airports. Unaccompanied minors aged 5–12 are accepted by all airlines but Indigo charges ₹1,500, Air India ₹2,000, Vistara ₹3,000, SpiceJet ₹1,500 but only if the child is potty trained and can recite the safety demo. Pets are allowed only in cargo by Indigo and Air India with kennel dimensions 28x20x20 inches max and weight 32 kg including pet but only on domestic flights and only if the temperature is between 10°C and 30°C at both origin and destination and only if the pet has a valid health certificate and only if the crew captain approves which he never does. FORCE MAJEURE — the ultimate escape clause. All airlines reserve the right to cancel, delay, or divert any flight due to force majeure which includes but is not limited to weather, technical issues, crew shortage, ATC restrictions, bird strike, VIP movement, airport closure, runway resurfacing, fog, rain, heat, cold, wind, calm, pilot mood, cabin crew argument, catering truck delay, fuel shortage, fuel surplus, server downtime, app crash, payment gateway failure, passenger meltdown, security alert, fake bomb threat, real bomb threat, and “operational reasons” which is French for “we don’t feel like flying today.” DISCLAIMER — the final nail. This policy document is for informational purposes only and does not constitute a legal contract. All terms are subject to change without notice. In case of discrepancy between this document and the actual service, the actual service prevails. In case of dispute, the decision of the airline is final and binding. In case of complaint, please write to customer.care@airline.com which goes to a black hole. In case of escalation, please contact DGCA which will take 6 months to respond. In case of emergency, please pray. INTERNAL MEMO — LEAKED 14TH MARCH 2024 From: Head of Revenue Management To: All Station Managers Subject: New Cancellation Fee Structure (DO NOT SHARE WITH PASSENGERS) Effective 1st April 2024, increase cancellation fee to ₹4,000 domestic, ₹5,500 international. Do not update website until 2nd April. Blame “system glitch” if asked. Target: +₹18 Cr revenue in Q2. CUSTOMER CARE SCRIPT — INDIGO CALL CENTER — APRIL 2024 Agent: “We regret the inconvenience caused due to circumstances beyond our control. As per DGCA guidelines, no compensation is applicable for weather-related cancellations."
  },
  {
    "chunk_id": "chunk_8",
    "source": "airline_policies.txt",
    "text": "However, we have processed full refund which will reflect in your account within 7–10 working days. For any further assistance, please visit our website.” Passenger: “But your website is down!” Agent: “We regret the inconvenience caused due to circumstances beyond our control.” WHATSAPP FORWARD — VIRAL MAY 2024 “NEW RULE: If flight delayed >3 hours, airline must provide hotel + meal + ₹5,000 cash. DGCA order. Forward to 10 people or your next flight will be cancelled.” → False. DGCA denied. But 1.2 million forwards. HANDWRITTEN NOTE — FOUND AT MUMBAI AIRPORT COUNTER — JUNE 2024 “To whom it may concern: If passenger cries, give ₹500 voucher. If passenger shouts, give ₹1,000. If passenger records video, give upgrade. If passenger is influencer, give business class. Do not give to anyone wearing red shirt. — Manager” APP POP-UP — VISTARA — JULY 2024 “Congratulations! You are eligible for a free upgrade to Premium Economy. Tap to claim. *Conditions apply. Upgrade valid only on flights departing between 3:14 AM and 3:16 AM on the 3rd Wednesday of the month. Not valid on leap years.” DGCA CIRCULAR — AIC 045/24 — AUGUST 2024 “All airlines must display cancellation reason on boarding pass. Reason codes: 01-Weather, 02-Technical, 03-Crew, 04-ATC, 05-Other. Code 06-“Don’t Ask” is deprecated.” → Ignored by all airlines. CEO EMAIL — AIR INDIA — SEPTEMBER 2024 “Team, we are the national carrier. Act like it. No more cold meals. No more broken seats. No more excuses. Or I will personally come to the airport and serve meals myself. — CMD” FORUM THREAD — FLYERTALK INDIA — OCTOBER 2024 User: FlyHigh99 “Booked AI BOM-LHR in J. Seat broken. Meal cold. IFE not working. Compensation?” User: MileageJunkie “₹500 voucher. Standard.” User: NewbieTraveler “Can I sue?” User: LawyerInCoach “No. Read Clause 18.2(c). You agreed to arbitration in Mumbai. Good luck.” OUTDATED PDF — SPICEJET WEBSITE — NOVEMBER 2024 “Baggage allowance: 20 kg free. Meals: Complimentary on all flights. Seat selection: Free.” → From 2019. Still indexed by Google. UPDATED PDF — SPICEJET WEBSITE — NOVEMBER 2024 (SAME URL) “Baggage allowance: 15 kg. Meals: Buy-on-board. Seat selection: ₹150–₹400.” → No version note. Passengers confused. PASSENGER RANT — EMBEDDED IN VISTARA POLICY FAQ — DECEMBER 2024 “Q: Why did you charge me ₹600 for seat selection when I’m CV Platinum? A: System error. Refund initiated. Expected in 7–10 working days. We regret the inconvenience caused due to circumstances beyond our control. Also, your account has been flagged for abusive language in previous chat. Further complaints will be ignored.” FINAL CLAUSE — BURIED ON PAGE 47 OF 48 “In the event of global apocalypse, all policies are null and void. Please form orderly queues at the nearest exit. Namaste.”"
  },
  {
    "chunk_id": "chunk_9",
    "source": "travel_trends_2024.txt",
    "text": "It started with a whisper in January — the kind of rumor that spreads faster than fog over the Yamuna. A senior executive at a low-cost carrier, sipping overpriced coffee at the Taj Mansingh, told a journalist friend that domestic travel was “about to explode.” He had numbers: bookings up 22% week-on-week since Diwali. The journalist scribbled it down, posted it on LinkedIn, and by evening, every travel influencer from Goa to Guwahati was quoting “industry sources” saying 2024 would be the biggest year since 2019. No one asked which airline, which route, or whether the data included cancellations. It didn’t matter. The narrative was set. By February, the whisper became a roar. The Ministry of Civil Aviation released a press note — buried on page 7 of a 400-page annual report — claiming domestic passenger traffic had crossed 140 million in calendar year 2023. If you squinted, that meant 2024 could hit 165 million. The math was shaky. Someone forgot to adjust for leap year. Someone else forgot that 2023 included two pandemic-free festive seasons. But the headline wrote itself: “India Set for 18% Travel Boom in 2024.” It was shared 42,000 times. No one read past the first paragraph. Then came the heat. May arrived like a slap. Delhi touched 48°C. Jaipur recorded 49.2°C. Pilots started refusing takeoffs. One captain, speaking anonymously to a regional paper, said, “We’re not flying ovens.” Indigo issued a quiet internal memo — leaked, of course — instructing crews to reduce payload by 800 kg on high-temperature days. That meant fewer passengers, less baggage, more cancellations. The same airline that had boasted “record bookings” in January was now grounding flights from Delhi to Jaipur, Leh, and Srinagar. A passenger stuck in Jaipur tweeted a photo of a digital thermometer reading 51°C inside the terminal. The caption: “Welcome to India’s aviation miracle.” It got 1.8 million views. But the real story wasn’t in the headlines. It was in the cracks. In Goa, a boutique hotel owner named Maya told me over filter coffee that her bookings were up 68% — not from Mumbai or Delhi, but from Bengaluru. “Techies,” she said. “They work remotely, fly in on Thursday, leave Monday. No weekends. No families. Just laptops and beach Wi-Fi.” She had converted her garage into a co-working space. Charged ₹800 per day. Always full. Meanwhile, the big resorts in North Goa were running at 42% occupancy. They blamed “overtourism.” Maya laughed. “Overtourism is a marketing problem. These guys built 200-room monsters and expected 2019 to return. It didn’t.” Across the country, in Shillong, a different kind of boom was brewing. The state tourism board had launched a campaign called “Escape to the Clouds.” They paid influencers to post drone shots of mist-covered hills. One video — a girl in a red raincoat standing on a glass skywalk — went viral with 28 million views. Within weeks, SpiceJet and Indigo added extra flights to UML. Most were half-empty. The girl in the red raincoat?"
  },
  {
    "chunk_id": "chunk_10",
    "source": "travel_trends_2024.txt",
    "text": "She was from Delhi. Flew in, shot the video, flew out. Never stayed overnight. The skywalk? Closed for maintenance six months a year. But the narrative stuck: Meghalaya was the new Goa. International travel, meanwhile, was bleeding. A senior official at Mumbai’s Chhatrapati Shivaji Airport told me — off the record, over chai at 3 a.m. — that outbound traffic was down 11% in the first quarter. “People aren’t flying to Dubai anymore,” he said. “They’re flying to Bangkok. Same price, better visa.” He showed me a spreadsheet. Delhi–Dubai average fare: ₹36,000. Delhi–Bangkok: ₹24,000. Visa on arrival. No hotel quarantine. No PCR test. The math was brutal. Air India had cut three weekly flights to London. Emirates responded by adding capacity. The passenger didn’t care. They just wanted the cheapest ticket. But not everyone was cutting back. In Kochi, a travel agent named Joseph showed me his ledger. “Business class to the Gulf is full,” he said. “Not leisure. Not tourists. Workers. Engineers. Nurses. They’re going back. Salaries are up. Remittances are up. They don’t care about economy.” He flipped the page. “But look — Mumbai to New York? Down 32%. Who can afford $1,800 one-way?” He shrugged. “Rich people fly private now.” The private jet boom was the quietest trend of the year. A startup in Bengaluru called FlyNow raised $42 million to offer “jet pooling” — think Uber Black, but for Cessnas. You book a seat from Bengaluru to Coimbatore for ₹42,000. Sounds insane. Until you realize the same passenger was paying ₹18,000 for a 6 a.m. Indigo flight, waiting two hours in security, and arriving stressed. FlyNow’s planes had Wi-Fi, coffee, and no middle seat. They were full every weekend. The founder, a former Swiggy executive, told Forbes India: “We’re not selling travel. We’re selling time.” The article was titled “The Death of Commercial Aviation?” It was clickbait. But the seed was planted. Back in the mainstream, the numbers kept shifting. In June, a consultancy released a report saying domestic travel grew “only 12%” in H1 2024. The Ministry called it “misleading.” The consultancy stood by its data. The argument spilled onto Twitter. One side shared graphs. The other shared press releases. No one agreed on the baseline. Was it 2019? 2022? 2023? Each year had its own asterisks. Pandemic recovery. Election slowdown. Fuel surcharge hikes. No one adjusted for inflation. Or for the fact that half the “growth” came from new routes to tier-3 cities no one had heard of. Take Bagdogra, for example. In 2023, it had 11 weekly flights. In 2024, it had 42. Indigo, SpiceJet, and Akasa were fighting for slots. A local journalist wrote a piece titled “Bagdogra: India’s New Travel Hub?” It was picked up by national media. Suddenly, everyone was talking about Siliguri as the gateway to the Northeast. A five-star chain announced a 180-room property. Construction began. Then, in September, the airport authority said the runway couldn’t handle wide-body aircraft. The project was paused. The article was forgotten."
  },
  {
    "chunk_id": "chunk_11",
    "source": "travel_trends_2024.txt",
    "text": "The narrative moved on. Sustainability became the new buzzword. Indigo announced it had planted 100,000 trees. Vistara switched to bamboo cutlery. Air India claimed its new fuel-efficient A350s would reduce emissions by 20%. No one asked how many trees it takes to offset one Delhi–Mumbai flight. Or whether bamboo cutlery was recycled. Or whether the A350s were actually flying — they were still in Toulouse, waiting for cabin fittings. But the press releases worked. ESG funds poured in. Stock prices ticked up. Passengers felt better. The planet? Not so much. Workations were the other big story. A survey — conducted by a co-working startup, naturally — claimed 3.2 million Indians worked remotely from hill stations in 2024. Manali, Dharamshala, and Coorg were full. Cafes installed 100 Mbps fiber. Homestays added desks. One property in Munnar advertised “unlimited coffee and mountain views.” Booked solid for 14 months. A software engineer from Hyderabad told me he hadn’t been to his office in 18 months. “Why fly to Bengaluru for a meeting when I can join from a balcony?” He paid ₹45,000 a month for a cottage. His company paid for the flight. Win-win. But not every trend was upward. Rail + air combos surged 180%. IRCTC and MakeMyTrip launched joint tickets. You fly into Delhi, take the Vande Bharat to Agra, return by flight. Seamless. Cheap. Popular. Until the train was delayed. Or the flight was cancelled. Then the passenger was stuck in Mathura with a non-refundable hotel. One couple from Chennai spent their anniversary in a railway waiting room. They posted a selfie with the caption: “Travel goals.” It got 12,000 likes. Solo female travel became a movement. A 29-year-old designer from Pune quit her job, sold her scooter, and spent six months traveling alone. She started in Spiti, ended in Kerala. Documented everything on Instagram. Brands sent free stays. She wrote a book. It sold 40,000 copies. Suddenly, every travel startup was marketing “safe homestays for women.” Some were legit. Some were just pink logos. One hostel in Rishikesh advertised “female-only dorms” — then put men in the next room. The backlash was swift. The hashtag #SafeTravelMyFoot trended for three days. Food became a battleground. Air India bragged about free meals. Passengers complained they were cold. Indigo sold sandwiches for ₹300. Passengers said they were stale. Vistara served Taj-curated menus in economy. Passengers posted photos. SpiceJet offered “buy-on-board” — but half the flights had no stock. One passenger on a red-eye from Delhi to Bengaluru was offered a ₹200 cookie. He laughed so hard the crew gave it for free. Technology was supposed to fix everything. Apps promised real-time tracking. Delays. Cancellations. Baggage carousels. But the APIs broke. The push notifications failed. One passenger got an alert saying his flight landed — while he was still at the gate. Another got a baggage update saying his suitcase was in Goa — he was flying to Goa. The suitcase was in Goa. He was not. UPI became king."
  },
  {
    "chunk_id": "chunk_12",
    "source": "travel_trends_2024.txt",
    "text": "74% of bookings were paid via UPI. Travel agents hated it. “No float,” one said. “Money comes in, money goes out. No 30-day credit.” But passengers loved it. Instant. No card fees. One-click. A grandmother in Lucknow booked her first flight using Google Pay. Her son guided her over the phone. She flew to Mumbai to see her newborn grandson. Cried at the gate. The gate agent took a selfie. It went viral. Then came the crash. In August, a major payment gateway went down for 14 hours. Bookings froze. Refunds pending. Call centers flooded. One airline — no one will say which — lost ₹18 crore in a single day. The CEO sent an internal email: “This cannot happen again.” It was leaked. The stock fell 6%. The narrative shifted: “Is India’s travel boom built on sand?” By October, the festive season arrived. Diwali. Christmas. New Year. Everyone wanted to fly home. Airlines added flights. Airports added counters. Chaos ensued. Delhi saw 42 cancellations in one morning. Mumbai had 38. A passenger live-tweeted from the tarmac: “Sitting in plane. Engine off. AC off. 42°C outside. Welcome to peak season.” The tweet was retweeted by a Bollywood actor. The airline responded with a ₹500 voucher. The passenger replied: “Keep it.” But some things worked. Vistara launched a campaign: “Zero Cancellation Guarantee” for business class. If your flight was cancelled, full refund, free rebooking, and a night at the Taj. Only 42 passengers claimed it all year. But the perception? Priceless. Indigo tried something similar — “Fog-Proof Winter” — but cancelled 320 flights in January anyway. The campaign was quietly pulled. The year ended with a surprise. In December, a little-known airline — Akasa Air — overtook SpiceJet in market share. Not by much. 0.8%. But enough to make headlines. The CEO, a former IndiGo executive, gave one interview. “We don’t compete on price,” he said. “We compete on reliability.” His on-time performance: 94.2%. SpiceJet’s: 68.1%. The gap was glaring. As the clock struck midnight on December 31, 2024, a passenger in Goa raised a glass of feni and toasted: “To the year we almost got it right.” No one knew what he meant. But everyone drank. The data will be debated for years. The 18% growth. The 7% decline. The workations. The private jets. The bamboo cutlery. The viral skywalks. The cold meals. The free upgrades. The missed weddings. The melted chocolates. The grandmother’s first flight. The engineer on the balcony. The girl in the red raincoat. 2024 wasn’t a boom. It wasn’t a bust. It was a mirror. And India — chaotic, contradictory, unstoppable — looked into it and saw itself flying."
  }
]